Autodesk.Revit.DB.ElementLogicalFilter.SetFilters(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementFilter})
Replaces current filters in the logical filter with any number of input filters.
Remarks:
The input filters will be copied.
filters:
A collection of input filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The filter collection is empty, or contains invalid inputs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020